microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dspic33ck-dab.X/sources/pwrctrl/dcdt/pwrctrl_dcdt.c
   SMPS_Controller2P2ZInitialize(&PMC_2p2z);  
   
   
   //discharger, SPPO,   Primary to Secondary Power Out loop
   PMC_2p2z_Rev.aCoefficients =  &PMC_2p2zACoefficients_Rev[0]; // Set up pointer to derived coefficients
   PMC_2p2z_Rev.bCoefficients =  &PMC_2p2zBCoefficients_Rev[0]; // Set up pointer to derived coefficients
   PMC_2p2z_Rev.controlHistory = &PMC_2p2zControlHistory_Rev[0]; // Set up pointer to controller history
   PMC_2p2z_Rev.errorHistory =   &PMC_2p2zErrorHistory_Rev[0]; // Set up pointer to error history

   PMC_2p2z_Rev.preShift =   DAB_SPPO_COMP_2P2Z_PRESHIFT;
   PMC_2p2z_Rev.postScaler = DAB_SPPO_COMP_2P2Z_POSTSCALER;
   PMC_2p2z_Rev.postShift =  DAB_SPPO_COMP_2P2Z_POSTSHIFT;
   PMC_2p2z_Rev.minOutput =  DAB_SPPO_COMP_2P2Z_MIN_CLAMP;
   PMC_2p2z_Rev.maxOutput =  DAB_SPPO_COMP_2P2Z_MAX_CLAMP; 
   
   PMC_2p2zACoefficients_Rev[0] = DAB_SPPO_COMP_2P2Z_COEFF_A1;
   PMC_2p2zACoefficients_Rev[1] = DAB_SPPO_COMP_2P2Z_COEFF_A2;
   PMC_2p2zBCoefficients_Rev[0] = DAB_SPPO_COMP_2P2Z_COEFF_B0;
   PMC_2p2zBCoefficients_Rev[1] = DAB_SPPO_COMP_2P2Z_COEFF_B1;
   PMC_2p2zBCoefficients_Rev[2] = DAB_SPPO_COMP_2P2Z_COEFF_B2;
  
    //explicit clear to 0
   PMC_2p2zControlHistory_Rev[0] =0;
   PMC_2p2zControlHistory_Rev[1] =0;
   PMC_2p2zErrorHistory_Rev[0] =0;
   PMC_2p2zErrorHistory_Rev[1] =0;
   PMC_2p2zErrorHistory_Rev[2] =0;
   
   SMPS_Controller2P2ZInitialize(&PMC_2p2z_Rev);  
   
}

/*******************************************************************************
 * @ingroup pwrctrl-dcdt
 * @brief  Clear the control and error histories of the control loops
 * @return void
 * 
 * @details This function clear the control and error histories of the control 
 *  loops. it is essential to call this function during restart condition.
 *********************************************************************************/
void PwrCtrl_ResetControlLoopHistories(void)
{
  //explicit clear to 0
  VMC_2p2zControlHistory[0] = 0;
  VMC_2p2zControlHistory[1] = 0;
  VMC_2p2zErrorHistory[0] = 0;
  VMC_2p2zErrorHistory[1] = 0;
  VMC_2p2zErrorHistory[2] = 0;
  
   //explicit clear to 0
   IMC_2p2zControlHistory[0] = 0;
   IMC_2p2zControlHistory[1] = 0;
   IMC_2p2zErrorHistory[0] = 0;
   IMC_2p2zErrorHistory[1] = 0;
   IMC_2p2zErrorHistory[2] = 0;
   
   //explicit clear to 0
   PMC_2p2zControlHistory[0] = 0;
   PMC_2p2zControlHistory[1] = 0;
   PMC_2p2zErrorHistory[0] = 0;
   PMC_2p2zErrorHistory[1] = 0;
   PMC_2p2zErrorHistory[2] = 0;
   
     //explicit clear to 0
  VMC_2p2zControlHistory_Rev[0] = 0;
  VMC_2p2zControlHistory_Rev[1] = 0;
  VMC_2p2zErrorHistory_Rev[0] = 0;
  VMC_2p2zErrorHistory_Rev[1] = 0;
  VMC_2p2zErrorHistory_Rev[2] = 0;
  
   //explicit clear to 0
   IMC_2p2zControlHistory_Rev[0] = 0;
   IMC_2p2zControlHistory_Rev[1] = 0;
   IMC_2p2zErrorHistory_Rev[0] = 0;
   IMC_2p2zErrorHistory_Rev[1] = 0;
   IMC_2p2zErrorHistory_Rev[2] = 0;
   
   //explicit clear to 0
   PMC_2p2zControlHistory_Rev[0] = 0;
   PMC_2p2zControlHistory_Rev[1] = 0;
   PMC_2p2zErrorHistory_Rev[0] = 0;
   PMC_2p2zErrorHistory_Rev[1] = 0;
   PMC_2p2zErrorHistory_Rev[2] = 0;
   
}

